# -------------------------------
# 🌐 Browsers
# -------------------------------
cask "firefox"
cask "google-chrome"
cask "brave-browser"

# -------------------------------
# ☁️ Cloud
# -------------------------------
cask "dropbox"

# -------------------------------
# 📡 Communication
# -------------------------------
cask "discord"
cask "microsoft-teams"
cask "proton-mail"
cask "protonvpn"
cask "zoom"

# -------------------------------
# 🖥️ Command Line
# -------------------------------
brew "displayplacer"
brew "git"
brew "mas"
brew "tree"

# -------------------------------
# 📝 Documents
# -------------------------------
cask "microsoft-office"
cask "pdf-expert"
mas "Kindle", id: 302584613

# -------------------------------
# 🌍 Language
# -------------------------------
mas "Rosetta Stone", id: 1476088902

# -------------------------------
# 📐 Math
# -------------------------------
cask "mathpix-snipping-tool"

# -------------------------------
# 📚 Notes
# -------------------------------
cask "notion"
mas "MindNode", id: 1289197285
mas "MindNode Next", id: 6446116532
mas "Notability", id: 360593530

# -------------------------------
# 👨‍💻 Programming
# -------------------------------
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "temurin@17"

# -------------------------------
# 🧠 Productivity
# -------------------------------
cask "chatgpt"
cask "claude"
cask "claude-code"

# -------------------------------
# 🔐 Security
# -------------------------------
cask "1password"
mas "1Password for Safari", id: 1569813296

# -------------------------------
# 🎛️ System
# -------------------------------
cask "alfred"
cask "logi-options-plus"
mas "24 Hour Wallpaper", id: 1226087575
mas "TextSniper", id: 1528890965

# -------------------------------
# 💹 Trading
# -------------------------------
cask "tradingview"